# входные данные:
# 3
# 9 15 1776
#
# ответ:
# 9 11 60
#
# wsd(1776) = 1 * 1 + 7 * 2 + 7 * 3 + 6 * 4 = 60

# import numpy # бібліотека

# a = 9
# b = 15
c = 1776

# a1 = len(str(a))
# b1 = len(str(b))
c1 = len(str(c))

c = [1, 7, 7, 6]    #потрібно розділяти автоматично зі значення с
i = 0
s1 = []
while i < c1:
    s = c[i] * i
    sb = s + c[i]

    s1.insert(i, sb)
    i += 1

print(s1[0] + s1[1] + s1[2] + s1[3])   # як сумувати автоматично по індексам

#print(numpy.sum(s1))   # numpy - додаткова бібліотека в python 2, треба закачати для python3!!!!!! - сумує значення в списку/масиві

